app/controllers/line_items_controller.rb

INSERT INTO "line_items" ("line_item_date_id", "name", "description", "quantity", "unit_price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @line_item = @line_item_date.line_items.build(line_item_params)

    if @line_item.save

SELECT "quotes".* FROM "quotes" WHERE "quotes"."company_id" = $1 AND "quotes"."id" = $2 LIMIT $3  [["company_id", 437724769], ["id", 309456473], ["LIMIT", 1]]
---
  def set_quote
    @quote = current_company.quotes.find(params[:quote_id])

SELECT "line_item_dates".* FROM "line_item_dates" WHERE "line_item_dates"."quote_id" = $1 AND "line_item_dates"."id" = $2 LIMIT $3  [["quote_id", 309456473], ["id", 869574343], ["LIMIT", 1]]
---
  def set_line_item_date
    @line_item_date = @quote.line_item_dates.find(params[:line_item_date_id])