app/controllers/line_item_dates_controller.rb

  def create
    @line_item_date = @quote.line_item_dates.build(line_item_date_params)

    if @line_item_date.save
---
INSERT INTO "line_item_dates" ("quote_id", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["quote_id", 908005740], ["date", "2024-10-30"], ["created_at", "2024-11-02 10:17:28.723061"], ["updated_at", "2024-11-02 10:17:28.723061"]]

  def destroy
    @line_item_date.destroy
---
DELETE FROM "line_item_dates" WHERE "line_item_dates"."id" = $1  [["id", 869574343]]
DELETE FROM "line_items" WHERE "line_items"."id" = $1  [["id", 1]]

  def set_line_item_date
    @line_item_date = @quote.line_item_dates.find(params[:id])
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."line_item_date_id" = $1  [["line_item_date_id", 869574343]]
SELECT "line_item_dates".* FROM "line_item_dates" WHERE "line_item_dates"."quote_id" = $1 AND "line_item_dates"."id" = $2 LIMIT $3  [["quote_id", 309456473], ["id", 869574343], ["LIMIT", 1]]

  def set_quote
    @quote = current_company.quotes.find(params[:quote_id])
---
SELECT "quotes".* FROM "quotes" WHERE "quotes"."company_id" = $1 AND "quotes"."id" = $2 LIMIT $3  [["company_id", 437724769], ["id", 309456473], ["LIMIT", 1]]