app/controllers/quotes_controller.rb

  def index
    @quotes = current_company.quotes.ordered
---
SELECT "quotes".* FROM "quotes" WHERE "quotes"."company_id" = $1 ORDER BY "quotes"."id" DESC  [["company_id", 437724769]]

  def show
    @line_item_dates = @quote.line_item_dates.includes(:line_items).ordered
---
SELECT "line_item_dates".* FROM "line_item_dates" WHERE "line_item_dates"."quote_id" = $1 ORDER BY "line_item_dates"."date" ASC  [["quote_id", 309456473]]
SELECT "line_items".* FROM "line_items" INNER JOIN "line_item_dates" ON "line_items"."line_item_date_id" = "line_item_dates"."id" WHERE "line_item_dates"."quote_id" = $1  [["quote_id", 309456473]]

  def create
    # @quote = Quote.new(quote_params)

    # if @quote.save
    #   respond_to do |format|
    #     format.html { redirect_to quotes_path, notice: "Quote was successfully created." }
    #     format.turbo_stream
    #   end
    # else
    #   render :new, status: :unprocessable_entity
    # end
    #
    @quote = current_company.quotes.build(quote_params)

    if @quote.save
---
INSERT INTO "quotes" ("name", "created_at", "updated_at", "company_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "New Quote"], ["created_at", "2024-11-02 10:17:04.457888"], ["updated_at", "2024-11-02 10:17:04.457888"], ["company_id", 437724769]]

  def update
    if @quote.update(quote_params)
---
UPDATE "quotes" SET "name" = $1, "updated_at" = $2 WHERE "quotes"."id" = $3  [["name", "My First quote"], ["updated_at", "2024-11-02 10:07:54.544091"], ["id", 309456473]]

  def set_quote
    @quote = current_company.quotes.find(params[:id])
---
SELECT "quotes".* FROM "quotes" WHERE "quotes"."company_id" = $1 AND "quotes"."id" = $2 LIMIT $3  [["company_id", 437724769], ["id", 908005739], ["LIMIT", 1]]